# -*- indent-tabs-mode: nil; -*-
#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:nil arch:headline author:t broken-links:nil
#+options: c:nil creator:nil d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:t
#+options: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t timestamp:t title:t toc:t
#+options: todo:t |:t
#+title: Kubernetes using Kubeadm
#+date: <2020-01-29 Wed>
#+author: Gregory Grubbs
#+email: gregory@dynapse.com
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 27.0.60 (Org mode 9.3.1)
#+setupfile: https://raw.githubusercontent.com/fniessen/org-html-themes/master/setup/theme-readtheorg.setup
#+PROPERTY: header-args:sh :comments org :shebang #!/usr/bin/env bash :tangle no
*** Install the Google Cloud SDK
    :PROPERTIES:
    :CUSTOM_ID: install-the-google-cloud-sdk
    :END:

Follow the Google Cloud SDK [[https://cloud.google.com/sdk/][documentation]] to install and configure the =gcloud= command line utility.

Verify the Google Cloud SDK version is 262.0.0 or higher:

#+begin_src sh :session k-sh :results output replace
  gcloud version
#+end_src

#+RESULTS:
#+begin_example
Google Cloud SDK 278.0.0
alpha 2020.01.24
beta 2020.01.24
bq 2.0.52
core 2020.01.24
gsutil 4.47
kubectl 2020.01.24


To take a quick anonymous survey, run:
gcloud survey
#+end_example

*** Verification
    :PROPERTIES:
    :CUSTOM_ID: verification
    :END:

Verify =cfssl= and =cfssljson= version 1.3.4 or higher is installed:

#+begin_src sh :session k-sh :results output replace
  cfssl version
#+end_src

#+RESULTS:
: Version: 1.4.1
: Runtime: go1.13.4

#+begin_quote
  output
#+end_quote

#+begin_example
  Version: 1.3.4
  Revision: dev
  Runtime: go1.13
#+end_example

#+begin_src sh :session k-sh :results output replace
  cfssljson --version
#+end_src

#+RESULTS:
: Version: 1.4.1
: Runtime: go1.13.4

#+begin_example
  Version: 1.3.4
  Revision: dev
  Runtime: go1.13
#+end_example

*** Verification
    :PROPERTIES:
    :CUSTOM_ID: verification-1
    :END:

Verify =kubectl= version 1.15.3 or higher is installed:

#+begin_src sh :session k-sh :results output replace
  kubectl version --client --short
#+end_src

#+RESULTS:
: Client Version: v1.16.2

#+begin_quote
  output
#+end_quote

#+begin_example
  Client Version: v1.15.3
#+end_example

Next: [[file:03-compute-resources.md][Provisioning Compute Resources]]
* Provisioning Compute Resources
  :PROPERTIES:
  :CUSTOM_ID: provisioning-compute-resources
  :END:

Kubernetes requires a set of machines to host the Kubernetes control plane and the worker nodes where containers are ultimately run. In this lab you will provision the compute resources required for running a secure and highly available Kubernetes cluster across a single [[https://cloud.google.com/compute/docs/regions-zones/regions-zones][compute zone]].

#+begin_quote
  Ensure a default compute zone and region have been set as described in the [[file:01-prerequisites.md#set-a-default-compute-region-and-zone][Prerequisites]] lab.
#+end_quote
#+begin_src sh :session k-sh :results output replace
gcloud config list
#+end_src

#+RESULTS:
: [compute]
: region = us-west2
: zone = us-west2-c
: [core]
: account = ggrubbs@mesosphere.io
: disable_usage_reporting = True
: project = konvoy-gcp-se
: 
: Your active configuration is: [default]


**** Create a firewall rule that allows external SSH, ICMP, and HTTPS:

#+begin_src sh :session k-sh :results none :tangle cluster-setup/bin/01-provision-gcp.sh
  gcloud compute firewall-rules create kubernetes-the-hard-way-allow-external \
    --allow tcp:22,tcp:6443,icmp \
    --network kubernetes-the-hard-way \
    --source-ranges 0.0.0.0/0
#+end_src

#+begin_quote
  An [[https://cloud.google.com/compute/docs/load-balancing/network/][external load balancer]] will be used to expose the Kubernetes API Servers to remote clients.
#+end_quote

List the firewall rules in the =kubernetes-the-hard-way= VPC network:

#+begin_src sh :session k-sh :results output replace 
  gcloud compute firewall-rules list --filter="network:kubernetes-the-hard-way"
#+end_src

#+RESULTS:
: NAME                                    NETWORK                  DIRECTION  PRIORITY  ALLOW                 DENY  DISABLED
: kubernetes-the-hard-way-allow-external  kubernetes-the-hard-way  INGRESS    1000      tcp:22,tcp:6443,icmp        False
: kubernetes-the-hard-way-allow-internal  kubernetes-the-hard-way  INGRESS    1000      tcp,udp,icmp                False
: 
: To show all fields of the firewall, please show in JSON format: --format=json
: To show all fields in table format, please see the examples in --help.
NAME                                    NETWORK                  DIRECTION  PRIORITY  ALLOW                 DENY  DISABLED
kubernetes-the-hard-way-allow-external  kubernetes-the-hard-way  INGRESS    1000      tcp:22,tcp:6443,icmp        False
kubernetes-the-hard-way-allow-internal  kubernetes-the-hard-way  INGRESS    1000      tcp,udp,icmp                False

To show all fields of the firewall, please show in JSON format: --format=json
To show all fields in table format, please see the examples in --help.

#+begin_quote
  output
#+end_quote

#+begin_example
  NAME                                    NETWORK                  DIRECTION  PRIORITY  ALLOW                 DENY
  kubernetes-the-hard-way-allow-external  kubernetes-the-hard-way  INGRESS    1000      tcp:22,tcp:6443,icmp
  kubernetes-the-hard-way-allow-internal  kubernetes-the-hard-way  INGRESS    1000      tcp,udp,icmp
#+end_example

**** Allocate a static IP address that will be attached to the external load balancer fronting the Kubernetes API Servers:

#+begin_src sh :session k-sh :results none :tangle cluster-setup/bin/01-provision-gcp.sh
  gcloud compute addresses create kubernetes-the-hard-way \
    --region $(gcloud config get-value compute/region)
#+end_src

Verify the =kubernetes-the-hard-way= static IP address was created in your default compute region:

#+begin_src sh :session k-sh :results output replace
  gcloud compute addresses list --filter="name=('kubernetes-the-hard-way')"
#+end_src

#+RESULTS:
: NAME                     ADDRESS/RANGE  TYPE      PURPOSE  NETWORK  REGION    SUBNET  STATUS
: kubernetes-the-hard-way  34.94.97.101   EXTERNAL                    us-west2          RESERVED

#+begin_quote
  output
#+end_quote

#+begin_example
  NAME                     REGION    ADDRESS        STATUS
  kubernetes-the-hard-way  us-west1  XX.XXX.XXX.XX  RESERVED
#+end_example

**** Create three compute instances which will host the Kubernetes control plane:
#+begin_src sh :session k-sh :results none :tangle cluster-setup/bin/01-provision-gcp.sh
CONTROL_INSTANCE_TYPE=n1-standard-4
  for i in 0 1; do
    gcloud compute instances create gg-controller-${i} \
      --async \
	  --no-address \
      --boot-disk-size 200GB \
      --can-ip-forward \
      --image-family ubuntu-1804-lts \
      --image-project ubuntu-os-cloud \
      --machine-type ${CONTROL_INSTANCE_TYPE} \
      --private-network-ip 10.240.0.1${i} \
      --scopes compute-rw,storage-ro,service-management,service-control,logging-write,monitoring \
      --subnet kubernetes \
      --tags kubernetes-the-hard-way,controller \
	  --labels owner=ggrubbs,expiration=48h
  done
#+end_src

List the create controller instances
#+begin_src sh :session k-sh :results table replace
gcloud compute instances list --filter="tags.items=kubernetes-the-hard-way AND tags.items=controller"
#+end_src

#+RESULTS:
| NAME            | ZONE       | MACHINE_TYPE  | PREEMPTIBLE |   INTERNAL_IP | EXTERNAL_IP | STATUS |
| gg-controller-0 | us-west2-c | n1-standard-4 | 10.240.0.10 |  34.94.56.188 | RUNNING     |        |
| gg-controller-1 | us-west2-c | n1-standard-4 | 10.240.0.11 | 34.94.182.163 | RUNNING     |        |
| gg-controller-2 | us-west2-c | n1-standard-4 | 10.240.0.12 |  35.235.77.77 | RUNNING     |        |

**** Create ${NUM_WORKERS} compute instances which will host the Kubernetes worker nodes:
#+begin_src sh :session k-sh :results none :tangle cluster-setup/bin/01-provision-gcp.sh
  WORKER_INSTANCE_TYPE=n1-standard-8
  NUM_WORKERS=3
	for i in $(seq 0 $((${NUM_WORKERS} - 1))) ; do
	# for i in 0 1 2; do
	  gcloud compute instances create gg-worker-${i} \
		--async \
		--no-address \
		--boot-disk-size 200GB \
		--can-ip-forward \
		--image-family ubuntu-1804-lts \
		--image-project ubuntu-os-cloud \
		--machine-type ${WORKER_INSTANCE_TYPE} \
		--metadata pod-cidr=10.200.${i}.0/24 \
		--private-network-ip 10.240.0.2${i} \
		--scopes compute-rw,storage-ro,service-management,service-control,logging-write,monitoring \
		--subnet kubernetes \
		--tags kubernetes-the-hard-way,worker \
		--labels owner=ggrubbs,expiration=48h
	done
#+end_src

#+RESULTS:
#+begin_example

▶  ~ ❯ projects ❯ … ❯ docs ▶  gregoryg ▶ $ ▶ > > > > > > > > > > > > > > NOTE: The users will be charged for public IPs when VMs are created.
Instance creation in progress for [gg-worker-0]: https://www.googleapis.com/compute/v1/projects/konvoy-gcp-se/zones/us-west2-c/operations/operation-1580347403479-59d514d9b2b14-47b5eb0d-04d928f3
Use [gcloud compute operations describe URI] command to check the status of the operation(s).
NOTE: The users will be charged for public IPs when VMs are created.
Instance creation in progress for [gg-worker-1]: https://www.googleapis.com/compute/v1/projects/konvoy-gcp-se/zones/us-west2-c/operations/operation-1580347406920-59d514dcfac59-892dfeed-90ace76a
Use [gcloud compute operations describe URI] command to check the status of the operation(s).
NOTE: The users will be charged for public IPs when VMs are created.
Instance creation in progress for [gg-worker-2]: https://www.googleapis.com/compute/v1/projects/konvoy-gcp-se/zones/us-west2-c/operations/operation-1580347410170-59d514e014220-3c02d392-56469a79
Use [gcloud compute operations describe URI] command to check the status of the operation(s).
#+end_example

List the created worker instances
#+begin_src sh :session k-sh :results table replace
gcloud compute instances list --filter="tags.items=kubernetes-the-hard-way AND tags.items=worker"
#+end_src

#+RESULTS:
| NAME        | ZONE       | MACHINE_TYPE  | PREEMPTIBLE |   INTERNAL_IP | EXTERNAL_IP | STATUS |
| gg-worker-0 | us-west2-c | n1-standard-8 | 10.240.0.20 |  35.236.1.139 | RUNNING     |        |
| gg-worker-1 | us-west2-c | n1-standard-8 | 10.240.0.21 | 35.236.93.211 | RUNNING     |        |
| gg-worker-2 | us-west2-c | n1-standard-8 | 10.240.0.22 | 34.94.175.154 | RUNNING     |        |
| gg-worker-3 | us-west2-c | n1-standard-8 | 10.240.0.23 |  34.94.206.98 | RUNNING     |        |
| gg-worker-4 | us-west2-c | n1-standard-8 | 10.240.0.24 | 35.236.113.11 | RUNNING     |        |
| gg-worker-5 | us-west2-c | n1-standard-8 | 10.240.0.25 |  34.94.241.86 | RUNNING     |        |

**** Create ${NUM_ETCD} compute instances which will host the Kubernetes etcd nodes:
#+begin_src sh :session k-sh :results none :tangle cluster-setup/bin/01-provision-gcp.sh
  ETCD_INSTANCE_TYPE=n1-standard-8
  NUM_ETCD=3
	for i in $(seq 0 $((${NUM_ETCD} - 1))) ; do
	# for i in 0 1 2; do
	  gcloud compute instances create gg-etcd-${i} \
		--async \
		--no-address \
		--boot-disk-size 200GB \
		--can-ip-forward \
		--image-family ubuntu-1804-lts \
		--image-project ubuntu-os-cloud \
		--machine-type ${ETCD_INSTANCE_TYPE} \
		--metadata pod-cidr=10.200.${i}.0/24 \
		--private-network-ip 10.240.0.3${i} \
		--scopes compute-rw,storage-ro,service-management,service-control,logging-write,monitoring \
		--subnet kubernetes \
		--tags kubernetes-the-hard-way,etcd \
		--labels owner=ggrubbs,expiration=48h
	done
#+end_src

#+RESULTS:
#+begin_example

▶  ~ ❯ projects ❯ … ❯ docs ▶  gregoryg ▶ $ ▶ > > > > > > > > > > > > > > NOTE: The users will be charged for public IPs when VMs are created.
Instance creation in progress for [gg-worker-0]: https://www.googleapis.com/compute/v1/projects/konvoy-gcp-se/zones/us-west2-c/operations/operation-1580347403479-59d514d9b2b14-47b5eb0d-04d928f3
Use [gcloud compute operations describe URI] command to check the status of the operation(s).
NOTE: The users will be charged for public IPs when VMs are created.
Instance creation in progress for [gg-worker-1]: https://www.googleapis.com/compute/v1/projects/konvoy-gcp-se/zones/us-west2-c/operations/operation-1580347406920-59d514dcfac59-892dfeed-90ace76a
Use [gcloud compute operations describe URI] command to check the status of the operation(s).
NOTE: The users will be charged for public IPs when VMs are created.
Instance creation in progress for [gg-worker-2]: https://www.googleapis.com/compute/v1/projects/konvoy-gcp-se/zones/us-west2-c/operations/operation-1580347410170-59d514e014220-3c02d392-56469a79
Use [gcloud compute operations describe URI] command to check the status of the operation(s).
#+end_example

List the created worker instances
#+begin_src sh :session k-sh :results table replace
gcloud compute instances list --filter="tags.items=kubernetes-the-hard-way AND tags.items=worker"
#+end_src

#+RESULTS:
| NAME        | ZONE       | MACHINE_TYPE  | PREEMPTIBLE |   INTERNAL_IP | EXTERNAL_IP | STATUS |
| gg-worker-0 | us-west2-c | n1-standard-8 | 10.240.0.20 |  35.236.1.139 | RUNNING     |        |
| gg-worker-1 | us-west2-c | n1-standard-8 | 10.240.0.21 | 35.236.93.211 | RUNNING     |        |
| gg-worker-2 | us-west2-c | n1-standard-8 | 10.240.0.22 | 34.94.175.154 | RUNNING     |        |
| gg-worker-3 | us-west2-c | n1-standard-8 | 10.240.0.23 |  34.94.206.98 | RUNNING     |        |
| gg-worker-4 | us-west2-c | n1-standard-8 | 10.240.0.24 | 35.236.113.11 | RUNNING     |        |
| gg-worker-5 | us-west2-c | n1-standard-8 | 10.240.0.25 |  34.94.241.86 | RUNNING     |        |
*** Verification
    :PROPERTIES:
    :CUSTOM_ID: verification
    :END:

List the compute instances in your default compute zone:

#+begin_src sh :session k-sh :results output replace
  gcloud compute instances list --filter="tags:kubernetes-the-hard-way"
  gcloud compute instances list --filter="tags.items=kubernetes-the-hard-way AND tags.items=controller" --format="csv(name)[no-heading]" > controller-nodes.txt
  gcloud compute instances list --filter="tags.items=kubernetes-the-hard-way AND tags.items=worker" --format="csv(name)[no-heading]" >  worker-nodes.txt
#+end_src

#+RESULTS:
#+begin_example
NAME             ZONE        MACHINE_TYPE   PREEMPTIBLE  INTERNAL_IP  EXTERNAL_IP  STATUS
gg-controller-0  us-west2-c  n1-standard-4               10.240.0.10               RUNNING
gg-controller-1  us-west2-c  n1-standard-4               10.240.0.11               RUNNING
gg-controller-2  us-west2-c  n1-standard-4               10.240.0.12               RUNNING
gg-worker-0      us-west2-c  n1-standard-8               10.240.0.20               RUNNING
gg-worker-1      us-west2-c  n1-standard-8               10.240.0.21               RUNNING
gg-worker-2      us-west2-c  n1-standard-8               10.240.0.22               RUNNING
gg-worker-3      us-west2-c  n1-standard-8               10.240.0.23               RUNNING
gg-worker-4      us-west2-c  n1-standard-8               10.240.0.24               RUNNING
gg-worker-5      us-west2-c  n1-standard-8               10.240.0.25               RUNNING
#+end_example


